Bachelor Thesis/3D.00/q8.003/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
    }


    outlet
    {
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
    }


    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }

	riverSlope_riverSlope
	{
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
	}

 
	left
	{
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
	}


	right
	{
        type            buoyantPressure;
        gradient        uniform 0;
        value           uniform 0;
	}

}
	
// ************************************************************************* //
